Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_i2c.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32L4R5_i2c equates.
 */

#pragma once

#include    <stdint.h>

// I2C address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    OAR1;
    volatile    uint32_t    OAR2;
    volatile    uint32_t    TIMINGR;
    volatile    uint32_t    TIMEOUTR;
    volatile    uint32_t    ISR;
    volatile    uint32_t    ICR;
    volatile    uint32_t    PECR;
    volatile    uint32_t    RXDR;
    volatile    uint32_t    TXDR;
} I2C_TypeDef;

#ifdef __cplusplus
#define I2C1    reinterpret_cast<I2C_TypeDef *>(0x40005400U)
#define I2C2    reinterpret_cast<I2C_TypeDef *>(0x40005800U)
#define I2C3    reinterpret_cast<I2C_TypeDef *>(0x40005C00U)
#define I2C4    reinterpret_cast<I2C_TypeDef *>(0x40008400U)

#else
#define I2C1    ((I2C_TypeDef *)0x40005400U)
#define I2C2    ((I2C_TypeDef *)0x40005800U)
#define I2C3    ((I2C_TypeDef *)0x40005C00U)
#define I2C4    ((I2C_TypeDef *)0x40008400U)
#endif

// CR1 Configuration

#define I2C_CR1_PECEN           (0x1U<<23U)
#define I2C_CR1_ALERTEN         (0x1U<<22U)
#define I2C_CR1_SMBDEN          (0x1U<<21U)
#define I2C_CR1_SMBHEN          (0x1U<<20U)
#define I2C_CR1_GCEN            (0x1U<<19U)
#define I2C_CR1_WUPEN           (0x1U<<18U)
#define I2C_CR1_NOSTRETCH       (0x1U<<17U)
#define I2C_CR1_SBC             (0x1U<<16U)
#define I2C_CR1_RXDMAEN         (0x1U<<15U)
#define I2C_CR1_TXDMAEN         (0x1U<<14U)
#define I2C_CR1_ANFOFF          (0x1U<<12U)
#define I2C_CR1_DNF             (0xFU<<8U)
#define I2C_CR1_DNF_0           (0x1U<<8U)
#define I2C_CR1_ERRIE           (0x1U<<7U)
#define I2C_CR1_TCIE            (0x1U<<6U)
#define I2C_CR1_STOPIE          (0x1U<<5U)
#define I2C_CR1_NACKIE          (0x1U<<4U)
#define I2C_CR1_ADDRIE          (0x1U<<3U)
#define I2C_CR1_RXIE            (0x1U<<2U)
#define I2C_CR1_TXIE            (0x1U<<1U)
#define I2C_CR1_PE              (0x1U<<0U)

// CR2 Configuration

#define I2C_CR2_SADD            (0x3FFU<<0U)
#define I2C_CR2_SADD_0          (0x1U<<0U)
#define I2C_CR2_RD_WRN          (0x1U<<10U)
#define I2C_CR2_ADD10           (0x1U<<11U)
#define I2C_CR2_HEAD10R         (0x1U<<12U)
#define I2C_CR2_START           (0x1U<<13U)
#define I2C_CR2_STOP            (0x1U<<14U)
#define I2C_CR2_NACK            (0x1U<<15U)
#define I2C_CR2_NBYTES          (0xFFU<<16U)
#define I2C_CR2_NBYTES_0        (0x1U<<16U)
#define I2C_CR2_RELOAD          (0x1U<<24U)
#define I2C_CR2_AUTOEND         (0x1U<<25U)
#define I2C_CR2_PECBYTE         (0x1U<<26U)

// OAR1 Configuration

#define I2C_OAR1_OA1EN          (0x1U<<15U)
#define I2C_OAR1_OA1MODE        (0x1U<<10U)
#define I2C_OAR1_OA1            (0x3FFU<<0U)
#define I2C_OAR1_OA1_0          (0x1U<<0U)

// OAR2 Configuration

#define I2C_OAR2_OA2EN          (0x1U<<15U)
#define I2C_OAR2_OA2MSK         (0x7U<<8U)
#define I2C_OAR2_OA2MSK_0       (0x1U<<8U)
#define I2C_OAR2_OA2            (0x7FU<<1U)
#define I2C_OAR2_OA2_0          (0x1U<<1U)

// TIMINGR Configuration

#define I2C_TIMINGR_PRESC       (0xFU<<28U)
#define I2C_TIMINGR_PRESC_0     (0x1U<<28U)
#define I2C_TIMINGR_SCLDEL      (0xFU<<20U)
#define I2C_TIMINGR_SCLDEL_0    (0x1U<<20U)
#define I2C_TIMINGR_SDADEL      (0xFU<<16U)
#define I2C_TIMINGR_SDADEL_0    (0x1U<<16U)
#define I2C_TIMINGR_SCLH        (0xFFU<<8U)
#define I2C_TIMINGR_SCLH_0      (0x1U<<8U)
#define I2C_TIMINGR_SCLL        (0xFFU<<0U)
#define I2C_TIMINGR_SCLL_0      (0x1U<<0U)

// TIMEOUTR Configuration

#define I2C_TIMEOUTR_TEXTEN     (0x1U<<31U)
#define I2C_TIMEOUTR_TIMEOUTB   (0xFFFU<<16U)
#define I2C_TIMEOUTR_TIMEOUTB_0 (0x1U<<16U)
#define I2C_TIMEOUTR_TIMOUTEN   (0x1U<<15U)
#define I2C_TIMEOUTR_TIDLE      (0x1U<<12U)
#define I2C_TIMEOUTR_TIMEOUTA   (0xFFFU<<0U)
#define I2C_TIMEOUTR_TIMEOUTA_0 (0x1U<<0U)

// ISR Configuration

#define I2C_ISR_TXE             (0x1U<<0U)
#define I2C_ISR_TXIS            (0x1U<<1U)
#define I2C_ISR_RXNE            (0x1U<<2U)
#define I2C_ISR_ADDR            (0x1U<<3U)
#define I2C_ISR_NACKF           (0x1U<<4U)
#define I2C_ISR_STOPF           (0x1U<<5U)
#define I2C_ISR_TC              (0x1U<<6U)
#define I2C_ISR_TCR             (0x1U<<7U)
#define I2C_ISR_BERR            (0x1U<<8U)
#define I2C_ISR_ARLO            (0x1U<<9U)
#define I2C_ISR_OVR             (0x1U<<10U)
#define I2C_ISR_PECERR          (0x1U<<11U)
#define I2C_ISR_TIMEOUT         (0x1U<<12U)
#define I2C_ISR_ALERT           (0x1U<<13U)
#define I2C_ISR_BUSY            (0x1U<<15U)
#define I2C_ISR_DIR             (0x1U<<16U)
#define I2C_ISR_ADDCODE         (0x7FU<<17U)
#define I2C_ISR_ADDCODE_0       (0x1U<<17U)

// ICR Configuration

#define I2C_ICR_ADDRCF          (0x1U<<3U)
#define I2C_ICR_NACKCF          (0x1U<<4U)
#define I2C_ICR_STOPCF          (0x1U<<5U)
#define I2C_ICR_BERRCF          (0x1U<<8U)
#define I2C_ICR_ARLOCF          (0x1U<<9U)
#define I2C_ICR_OVRCF           (0x1U<<10U)
#define I2C_ICR_PECCF           (0x1U<<11U)
#define I2C_ICR_TIMOUTCF        (0x1U<<12U)
#define I2C_ICR_ALERTCF         (0x1U<<13U)

// PECR Configuration

#define I2C_PECR_PEC            (0xFFU<<0U)
#define I2C_PECR_PEC_0          (0x1U<<0U)

// RXDR Configuration

#define I2C_RXDR_RXDATA         (0xFFU<<0U)
#define I2C_RXDR_RXDATA_0       (0x1U<<0U)

// TXDR Configuration

#define I2C_TXDR_TXDATA         (0xFFU<<0U)
#define I2C_TXDR_TXDATA_0       (0x1U<<0U)
